{
    "Projects": "مشاريعي",
    "About Me": "نبذة عني",
    "Contact": "تواصل معي ",
    "Download CV": "تنزيل السيرة الذاتية",
    "Phone store services": "خدمات متجر الهاتف",
    "Blog Services": "خدمات المدونة",
    "Close": "إغلاق",
    "ar": "English",
    "en": "Arabic",
    "Projects Screenshots": "لقطات من المشاريع",
    "404 Page Not found": "الصفحة غير موجودة",
    "Hire Me": "وظفني",
    "AboutMe1": "مرحبًا! أنا مطور ويب متكامل ولدي خبرة في Laravel و Vue.js. مع عدة سنوات من الخبرة في هذا المجال ، صقلت مهاراتي في بناء تطبيقات ويب قوية وقابلة للتطوير تلبي احتياجات عملائي.",
    "AboutMe2": "بصفتي مطورًا لـ Laravel ، فأنا على دراية جيدة بلغة PHP وإطار عمل Laravel ، اللذين أستخدمهما لإنشاء حلول خلفية تدعم تطبيقات الويب. تسمح لي كفاءتي في إطار عمل Laravel ببناء أنظمة معقدة بسهولة ، من تصميم قاعدة البيانات إلى تكامل واجهة برمجة التطبيقات.",
    "AboutMe3": "في الواجهة الأمامية ، أنا متخصص في Vue.js ، الذي أستخدمه لإنشاء واجهات مستخدم ديناميكية وتفاعلية. أنا أيضًا بارع في HTML و CSS و JavaScript ، والتي أستخدمها لضمان التكامل السلس للواجهة الأمامية والخلفية.",
    "AboutMe4": "بالإضافة إلى مهاراتي الفنية ، أنا ملتزم بتزويد عملائي بخدمة عملاء استثنائية. أستغرق الوقت الكافي لفهم احتياجاتهم والعمل بشكل تعاوني معهم لتقديم حلول تفوق توقعاتهم.",
    "AboutMe5": "إذا كنت تبحث عن مطور Laravel و Vue.js موثوق به وذو خبرة لبناء تطبيق الويب التالي ، فأنا أحب العمل معك. دعنا نتواصل ونناقش متطلبات مشروعك!",
    "Contact details": "تفاصيل جهة الاتصال",
    "Contact Form": "نموذج الاتصال",
    "Full Name": "الاسم الكامل",
    "Email": "البريد الإلكتروني",
    "Subject": "الموضوع",
    "Message": "الرسالة",
    "Send Message": "إرسال الرسالة",
    "Years of experience": "سنوات الخبرة",
    "Stars on GitHub": "github النجوم على",
    "Positive feedback": "التعليقات الإيجابية",
    "Projects completed": "المشاريع المنجزة",
    "Some of the brands I have worked with": "بعض العلامات التجارية التي عملت معها",
    "Project Type": "نوع المشروع",
    "Details": "التفاصيل",
    "Ecommerce": "التجارة الإلكترونية",
    "Business Website": "موقع تجاري",
    "Elearn": "التعليم الإلكتروني",
    "Blogs": "المدونات",
    "Related Projects": "مشاريع ذات صلة",
    "Project Management UI": "واجهة مستخدم إدارة المشروع",
    "UI / Frontend": "واجهة المستخدم / الواجهة الأمامية",
    "Challenge": "التحديات",
    "About Client": "حول العميل",
    "Objective": "الأهداف",
    "Tools & Technologies": "الأدوات والتقنيات",
    "Share This": "شارك هذا",
    "Name": "الاسم",
    "Business": "الأعمال التجارية",
    "Phones Store": "متجر هواتف",
    "Blog": "مدونة",
    "Clothes Store": "متجر ملابس",
    "Portfolio": "محفظة",
    "Company Ltd": "الشركة المحدودة",
    "Website": "الموقع الإلكتروني",
    "Phone": "الهاتف",
    "UI Design & Frontend Development": "تصميم واجهة المستخدم وتطوير الواجهة",
    "details1": "التوافق عبر المستعرضات: تمتلك متصفحات الويب المختلفة محركات عرض مختلفة وقد تفسر كود اش تي ام ال و سي اس اس وجافا سكريبت بشكل مختلف. نتيجة لذلك ، قد يبدو تصميم واجهة المستخدم وتطوير الواجهة الأمامية لمشروع الويب الخاص بك ويعملان بشكل مختلف عبر المتصفحات المختلفة. يمكن أن يمثل ضمان التوافق عبر المستعرضات تحديًا ، حيث يتطلب الاختبار وتصحيح الأخطاء على أنظمة أساسية وأجهزة متعددة. ",
    "details2": "تصميم سريع الاستجابة: مع الاستخدام المتزايد للأجهزة المحمولة للوصول إلى الإنترنت ، من المهم تصميم وتطوير مواقع الويب التي تستجيب وتتكيف مع أحجام الشاشات المختلفة. يمكن أن يكون هذا تحديًا ، خاصةً عند التعامل مع التخطيطات المعقدة أو الميزات التفاعلية. ",
    "details3": "تحسين الأداء: يتوقع المستخدمون تحميل مواقع الويب بسرعة وسلاسة ، ويمكن أن تؤدي أوقات التحميل البطيئة أو الرسوم المتحركة المتقطعة إلى الإحباط وتجربة مستخدم سلبية. يمكن أن يمثل تحسين أداء موقع الويب تحديًا ، لأنه يتضمن إيجاد توازن بين تقديم صور عالية الجودة وتقليل أوقات التحميل. ",
    "details4": "إمكانية الوصول: تضمن إمكانية الوصول إلى الويب أن المستخدمين ذوي الاحتياجات الخاصة يمكنهم الوصول إلى مشروع الويب الخاص بك واستخدامه. يمكن أن يشمل ذلك تصميم مواقع الويب وتطويرها بحيث تكون ملائمة لقارئ الشاشة ، ولها اختصارات لوحة المفاتيح ، ويسهل التنقل فيها باستخدام التكنولوجيا المساعدة. يمكن أن يمثل ضمان إمكانية الوصول إلى الويب تحديًا ، حيث يتطلب فهمًا عميقًا لإرشادات الوصول والاختبار باستخدام مجموعة من التقنيات المساعدة. ",
    "Objective1": "تصميم محوره المستخدم: الهدف من التصميم الذي يركز على المستخدم هو إنشاء موقع ويب يلبي احتياجات المستخدم. يجب أن يعتمد تصميم وتطوير موقع الويب على أبحاث المستخدم ، وردود الفعل ، والاختبار ، ويجب أن يعطي الأولوية لقابلية الاستخدام وإمكانية الوصول.",
    "What project are you looking for?": "ما هو المشروع الذي تبحث عنه؟",
    "Send Request": "إرسال",
    "Projects Portfolio": "محفظة المشاريع",
    "Search projects by title or filter by category": "البحث عن المشاريع حسب العنوان أو التصفية حسب الفئة",
    "All Projects": "كل المشاريع",
    "More Projects": "المزيد من المشاريع",
    "Follow me": "تابعني",
    "Hi, Iam Mostfa": "مصطفى بوجمعة",
    "Job Title": " vuejs مطور ويب لارافيل و",
    "Services": "الخدمات",
    "Services": "الخدمات",
    "Services": "الخدمات",
    "Services": "الخدمات"
}
