{
    "Projects": "مشاريعي",
    "About Me": "نبذة عني",
    "Contact": "تواصل معي ",
    "Download CV": "تنزيل السيرة الذاتية",
    "Phone store services": "خدمات متجر الهاتف",
    "Blog Services": "خدمات المدونة",
    "Close": "إغلاق",
    "ar": "English",
    "en": "Arabic",
    "Projects Screenshots": "لقطات من المشاريع",
    "404 Page Not found": "الصفحة غير موجودة",
    "Hire Me": "وظفني",
    "AboutMe1": "مرحبًا! أنا مطور ويب متكامل ولدي خبرة في Laravel و Vue.js. مع عدة سنوات من الخبرة في هذا المجال ، صقلت مهاراتي في بناء تطبيقات ويب قوية وقابلة للتطوير تلبي احتياجات عملائي.",
    "AboutMe2": "بصفتي مطورًا لـ Laravel ، فأنا على دراية جيدة بلغة PHP وإطار عمل Laravel ، اللذين أستخدمهما لإنشاء حلول خلفية تدعم تطبيقات الويب. تسمح لي كفاءتي في إطار عمل Laravel ببناء أنظمة معقدة بسهولة ، من تصميم قاعدة البيانات إلى تكامل واجهة برمجة التطبيقات.",
    "AboutMe3": "في الواجهة الأمامية ، أنا متخصص في Vue.js ، الذي أستخدمه لإنشاء واجهات مستخدم ديناميكية وتفاعلية. أنا أيضًا بارع في HTML و CSS و JavaScript ، والتي أستخدمها لضمان التكامل السلس للواجهة الأمامية والخلفية.",
    "AboutMe4": "بالإضافة إلى مهاراتي الفنية ، أنا ملتزم بتزويد عملائي بخدمة عملاء استثنائية. أستغرق الوقت الكافي لفهم احتياجاتهم والعمل بشكل تعاوني معهم لتقديم حلول تفوق توقعاتهم.",
    "AboutMe5": "إذا كنت تبحث عن مطور Laravel و Vue.js موثوق به وذو خبرة لبناء تطبيق الويب التالي ، فأنا أحب العمل معك. دعنا نتواصل ونناقش متطلبات مشروعك!",
    "Contact details": "تفاصيل جهة الاتصال",
    "Contact Form": "نموذج الاتصال",
    "Full Name": "الاسم الكامل",
    "Email": "البريد الإلكتروني",
    "Subject": "الموضوع",
    "Message": "الرسالة",
    "Send Message": "إرسال الرسالة",
    "Years of experience": "سنوات الخبرة",
    "Stars on GitHub": "github النجوم على",
    "Positive feedback": "التعليقات الإيجابية",
    "Projects completed": "المشاريع المنجزة",
    "Some of the brands I have worked with": "بعض العلامات التجارية التي عملت معها",
    "Project Type": "نوع المشروع",
    "Details": "التفاصيل",
    "Ecommerce": "التجارة الإلكترونية",
    "Business Website": "موقع تجاري",
    "Elearn": "التعليم الإلكتروني",
    "Blogs": "المدونات",
    "Related Projects": "مشاريع ذات صلة",
    "Project Management UI": "واجهة مستخدم إدارة المشروع",
    "UI / Frontend": "واجهة المستخدم / الواجهة الأمامية",
    "Challenge": "التحديات",
    "About Client": "حول العميل",
    "Objective": "الأهداف",
    "Tools & Technologies": "الأدوات والتقنيات",
    "Share This": "شارك هذا",
    "Name": "الاسم",
    "Business": "الأعمال التجارية",
    "Phones Store": "متجر هواتف",
    "Blog": "مدونة",
    "Clothes Store": "متجر ملابس",
    "Portfolio": "محفظة",
    "Company Ltd": "الشركة المحدودة",
    "Website": "الموقع الإلكتروني",
    "Phone": "الهاتف",
    "UI Design & Frontend Development": "تصميم واجهة المستخدم وتطوير الواجهة",
    "details1": "التوافق عبر المستعرضات: تمتلك متصفحات الويب المختلفة محركات عرض مختلفة وقد تفسر كود اش تي ام ال و سي اس اس وجافا سكريبت بشكل مختلف. نتيجة لذلك ، قد يبدو تصميم واجهة المستخدم وتطوير الواجهة الأمامية لمشروع الويب الخاص بك ويعملان بشكل مختلف عبر المتصفحات المختلفة. يمكن أن يمثل ضمان التوافق عبر المستعرضات تحديًا ، حيث يتطلب الاختبار وتصحيح الأخطاء على أنظمة أساسية وأجهزة متعددة. ",
    "details2": "تصميم سريع الاستجابة: مع الاستخدام المتزايد للأجهزة المحمولة للوصول إلى الإنترنت ، من المهم تصميم وتطوير مواقع الويب التي تستجيب وتتكيف مع أحجام الشاشات المختلفة. يمكن أن يكون هذا تحديًا ، خاصةً عند التعامل مع التخطيطات المعقدة أو الميزات التفاعلية. ",
    "details3": "تحسين الأداء: يتوقع المستخدمون تحميل مواقع الويب بسرعة وسلاسة ، ويمكن أن تؤدي أوقات التحميل البطيئة أو الرسوم المتحركة المتقطعة إلى الإحباط وتجربة مستخدم سلبية. يمكن أن يمثل تحسين أداء موقع الويب تحديًا ، لأنه يتضمن إيجاد توازن بين تقديم صور عالية الجودة وتقليل أوقات التحميل. ",
    "details4": "إمكانية الوصول: تضمن إمكانية الوصول إلى الويب أن المستخدمين ذوي الاحتياجات الخاصة يمكنهم الوصول إلى مشروع الويب الخاص بك واستخدامه. يمكن أن يشمل ذلك تصميم مواقع الويب وتطويرها بحيث تكون ملائمة لقارئ الشاشة ، ولها اختصارات لوحة المفاتيح ، ويسهل التنقل فيها باستخدام التكنولوجيا المساعدة. يمكن أن يمثل ضمان إمكانية الوصول إلى الويب تحديًا ، حيث يتطلب فهمًا عميقًا لإرشادات الوصول والاختبار باستخدام مجموعة من التقنيات المساعدة. ",
    // "Objective1": "تصميم محوره المستخدم: الهدف من التصميم الذي يركز على المستخدم هو إنشاء موقع ويب يلبي احتياجات المستخدم. يجب أن يعتمد تصميم وتطوير موقع الويب على أبحاث المستخدم ، وردود الفعل ، والاختبار ، ويجب أن يعطي الأولوية لقابلية الاستخدام وإمكانية الوصول.",
    "What project are you looking for?": "ما هو المشروع الذي تبحث عنه؟",
    "Send Request": "إرسال",
    "Projects I worked On": "مشاريع عملت عليها",
    "Search projects by title or filter by category": "البحث عن المشاريع حسب العنوان أو التصفية حسب الفئة",
    "All Projects": "كل المشاريع",
    "More Projects": "المزيد من المشاريع",
    "Contact me": "تابعني",
    "details0A": "مرحبًا بكم في \"موقع DB الشهير\" ، وهو تطبيق React JS ديناميكي وآسر يجلب العالم السينمائي إلى شاشتك.من خلال واجهة سلسة وتفاعلية ، يعمل هذا الموقع كمركز لاكتشاف الأفلام الأكثر شعبية والمسلسلات التلفزيونية والممثلين في الوقت الحالي ، وكلها مدعومة من واجهة برمجة تطبيقات خارجي.الغوص في عالم الترفيه أثناء استكشاف الأفلام الجريئة ، والعروض الجديرة بالشراوة ، والمواهب التي تعيد الحياة.",
    "details0B": "المبني على قوة React JS ، يوفر موقع Movie DB الشهير تجربة تركز على المستخدم تغمرك في عالم السينما.يتيح لك تصميم موقع الويب البديهي التنقل دون عناء من خلال الفئات ، واستكشاف المحتوى المميز ، والتعمق في ملفات تعريف الممثلين لمعرفة المزيد عن شخصياتك المفضلة على الشاشة.يضمن دمج واجهة برمجة التطبيقات الخارجية أن تكون محدثًا دائمًا مع أحدث الإصدارات والاتجاهات في صناعة الترفيه.",
    "details0C": "سواء كنت من مشاهد cinephile أو عارض غير رسمي ، فإن موقع الويب الشهير DB يخدم تفضيلاتك.تصفح من خلال ملصقات الأفلام الجذابة بصريًا ، ومشاهدة المقطورات ، وقراءة الملخصات ، واكتشاف التفاصيل المثيرة حول طاقم العمل والطاقم.من الأفلام المشهورة بشكل نقدي إلى الأحجار الكريمة المخفية ، يقدم منصتنا مجموعة مختارة من المحتوى الذي يلبي مجموعة واسعة من الأذواق.",
    "details0D": "موقع DB Movie الشهير لا يقتصر فقط على عرض الترفيه ؛يتعلق الأمر بالاحتفال بفن سرد القصص والمواهب التي تجلب الروايات إلى الحياة.من خلال دمجها السلس لبيانات React JS و API الخارجية ، يخلق موقعنا على شبكة الإنترنت تجربة غامرة تتيح لك التعامل مع عالم الأفلام والمسلسلات كما لم يحدث من قبل.ابق في الحلقة مع أحدث الاتجاهات ، واستكشف عمل الممثلين المفضلين لديك ، وانغمس في سحر الشاشة الكبيرة والصغيرة - كل ذلك ضمن الإطار الآسر لموقع DB Movie الشهير.",
    "Objective0": "يتمثل الهدف الأساسي في \"موقع الأفلام الشهير DB\" في توفير تطبيق React JS ديناميكي وغامرة يعمل كمنصة شاملة للمستخدمين لاستكشاف أحدث الاتجاهات في الأفلام والمسلسلات التلفزيونية والممثلين.من خلال التكامل مع واجهة برمجة تطبيقات خارجية ، يهدف موقع الويب إلى تقديم معلومات محدثة حول المحتوى الأكثر شعبية والتجاري ، مما يوفر للمستخدمين تجربة تفاعلية وجذابة بصريًا.من خلال عرض مجموعة مختارة من الأفلام والمسلسلات وملامح المواهب ، يسعى الموقع إلى تلبية جمهور متنوع من عشاق الترفيه ، وتمكينهم من اكتشاف العالم والتواصل مع العالم الديناميكي للسينما والتلفزيون.",
    
    "details1A": "TamtamTools هي منصة تصميم رسومية عبر الإنترنت مع واجهة نظيفة وحديثة.يوفر أدوات تصميم سهلة الاستخدام وقوالب مصممة بشكل احترافي للمواد التسويقية ورسومات الوسائط الاجتماعية والعروض التقديمية والمزيد.يمكن للمستخدمين اختيار قوالب للنشرات ، ومشاركات Instagram ، والكتيبات ، والمزيد.",
    "details1B": "يجعل محرر السحب والإفلات تخصيص القوالب بسيطة.يمكن للمستخدمين إضافة نص وصور ومقاطع فيديو وتغيير الألوان والخطوط والتخطيطات بسرعة.تتوفر ميزات التحرير المفيدة مثل إزالة الخلفية وتغيير حجم الصور وتشكيل واردات الملصقات.هناك أيضًا أدوات لإنشاء رسومات وعروض على وسائل التواصل الاجتماعي.",
    "details1C": "تم تصميم موقع الويب باستخدام Laravel PHP على الواجهة الخلفية ويدمج jQuery و Bootstrap 4 على الواجهة الأمامية.LARAVEL تعالج منطق التطبيق مثل المصادقة ، قاعدة البيانات ، التوجيه بينما يوفر Bootstrap تخطيطًا مستجيبًا ويمكّن jQuery عناصر تفاعلية.",
    "details1D": "تستخدم قدرات الرسومات معالجة JS/JQuery من HTML/CSS.يدير Laravel ميزات الواجهة الخلفية القوية مثل معالجة الصور والأمان والتحسينات توفر السرعة وقابلية التوسع.يوفر مزيج التقنيات منصة تصميم الرسوم الكاملة.",
    "Objective1": "الهدف الرئيسي من TamtamTools هو توفير منصة تصميم رسومات عبر الإنترنت سهلة الاستخدام لغير المصورين لإنشاء محتوى مرئي بسرعة للأعمال ووسائل التواصل الاجتماعي والاحتياجات الشخصية باستخدام القوالب المصممة باحتراف وأدوات التحرير البديهية.ويهدف إلى تمكين المستخدمين من إنشاء مواد تسويقية عالية الجودة ، والمنشورات الاجتماعية ، والعروض التقديمية والرسومات الأخرى من خلال محرر السحب والإفلات ، وقدرات التخصيص بدلاً من طلب خبرة واسعة في التصميم.",
    
    "details2A": "مرحبًا بكم في \"Elearn\" - منصة تعليمية مبتكرة عبر الإنترنت مدعومة من PHP و WordPress ، مكرسة لجلب التعليم إلى متناول يدك.يقدم Elearn مجموعة متنوعة من الدورات التدريبية التي تلبي احتياجات المتعلمين من جميع المستويات ، مما يتيح لهم توسيع معارفهم ، واكتساب مهارات جديدة ، وتحقيق نمو شخصي ومهني من راحة مساحاتهم الخاصة.من خلال واجهة سهلة الاستخدام ومكتبة واسعة من الدورات ، فإن Elearn هي بوابةك لعالم من فرص التعلم غير المحدودة.",
    "details2B": "مبني على الأساس القوي من PHP ويسخير من خلال مرونة WordPress ، Elearn يضمن تجربة مستخدم سلسة وبديهية.تضمن هندسة موقع الويب تصميمًا مستجيبًا ، مما يسمح للطلاب بالوصول إلى الدورات التدريبية من مختلف الأجهزة.من ورش العمل التي تركز على المهارات إلى مواضيع أكاديمية شاملة ، تغطي عروض الدورات التي تعود إلى Elearn طيفًا واسعًا ، مما يمكّن المستخدمين من تصميم رحلة التعلم الخاصة بهم وفقًا لمصالحهم وأهدافهم.",
    "details2C": "تم تصميم Elearn لتمكين كل من المدربين والمتعلمين.يمكن للمدربين بسهولة إنشاء وإدارة الدورات التدريبية ، وتحميل محتوى الوسائط المتعددة الغنية ، والتفاعل مع الطلاب من خلال منتديات مناقشة تفاعلية ، وتتبع تقدم المتعلم.يستفيد الطلاب من بيئة تعليمية غامرة تتضمن محاضرات الفيديو والمسابقات والواجبات والموارد القابلة للتنزيل ، وتعزيز تجربة تعليمية جذابة وفعالة.تشجع ميزات Elearn التعاونية شعورًا بمشاركة المجتمع والمعرفة بين المتعلمين ، مما يعزز الرحلة التعليمية الشاملة.",
    "details2D": "يمكن أن يكون التنقل في العالم المعقد للتعليم عبر الإنترنت ساحقًا ، لكن Elearn يبسط العملية من خلال توفير منصة سهلة الاستخدام تؤكد إمكانية الوصول والتفاعل والجودة.من خلال الواجهة البديهية ، وعروض الدورات المتنوعة ، وإطار الواجهة الخلفية القوية ، يقف Elearn كدليل على قوة PHP و WordPress في إنشاء نظام بيئي تعليمي ديناميكي عبر الإنترنت يتجاوز الحدود الجغرافية ويمكّن الأفراد من الشروع في رحلة مدى الحياة من الإثراء الثقيل.",
    "Objective2": "الهدف الأساسي من \"Elearn\" هو إنشاء موقع ويب WordPress الديناميكي الذي يحركه PHP ويعمل كمركز تعليمي شامل عبر الإنترنت ، مما يوفر للمستخدمين الوصول إلى مجموعة واسعة من الدورات عبر مختلف التخصصات.من خلال تقديم واجهة بديهية ، ومواد دورة تفاعلية ، وميزات قوية للمدربين والطلاب ، تهدف Elearn إلى إضفاء الطابع الديمقراطي على التعليم ، وتمكين المتعلمين من جميع الخلفيات لاكتساب مهارات جديدة وتوسيع معرفتهم ، وتعزيز النمو الشخصي والمهني من خلال الدورات التدريبية المرنة والمتاحة على الإنترنت.",
    
    "details3A": "تقديم \"iauto\"-منصة متطورة على الإنترنت تدمج بسلاسة قوة Laravel و Vue.js لإحداث ثورة في الطريقة التي تشتري بها ومزاد السيارات.مع واجهة أنيقة وبديهية ، يجلب Iauto التشويق من التسوق في السيارات ومزاداتك إلى أطراف أصابعك.تلبي منصتنا كل من المشترين المميزين الذين يبحثون عن تجربة شراء واضحة للشراء والعشاق الذين يتطلعون إلى المشاركة في مزادات السيارات المبهجة ، كل ذلك ضمن نظام بيئي موحد واحد.",
    "details3B": "مدعومًا من إطار Laravel القوي ، يضمن Iauto عمليات خلفية سلسة ، وتوفير مصادقة مستخدم آمنة ، وإدارة المخزون المبسطة ، ومعالجة المعاملات الفعالة.إلى جانب Vue.js ، يقدم الواجهة الأمامية لدينا تحديثات ديناميكية وفي الوقت الفعلي ، مما يتيح للمستخدمين استكشاف مجموعة متنوعة من المركبات ، وعرض المواصفات التفصيلية ، ووضع العطاءات في المزادات بسهولة.سواء كنت تبحث عن طراز ونموذج محدد أو متلهف للمشاركة في إثارة مزاد السيارة ، فإن Iauto يقدم تجربة مستخدم لا مثيل لها.",
    "details3C": "لا يتعلق Iauto فقط بشراء السيارات - بل يتعلق بإنشاء مجتمع من عشاق السيارات.تستضيف منصتنا مزادات السيارات المبهجة ، التي تحمل علامة \"السيارات\" ، حيث يمكن للمستخدمين المشاركة في حروب العطاءات النابضة بالحياة ، والتواصل مع الأفراد المتشابهين في التفكير الذين يشاركونهم شغفًا بالسيارات.من خلال تكامل سلس لآلية المزاد ، يمكن للمستخدمين وضع عطاءات ، ومراقبة تقدم المزاد ، وتلقي الإخطارات في الوقت الفعلي ، مضيفًا عنصرًا من الإثارة والمنافسة على عملية شراء السيارات.",
    "details3D": "علاوة على ذلك ، تقدم IAUTO مجموعة من الميزات لتلبية تفضيلات المستخدم المتنوعة.من مرشحات البحث المتقدمة التي تساعدك على تحديد سيارتك أحلامك ، إلى تاريخ السيارات المفصل وتقارير التفتيش التي تضمن الشفافية والثقة في عملية الشراء ، تم تصميم Iauto لتوفير تجربة تسوق شاملة وجديرة بالثقة.جرب مستقبل شراء السيارات والمزادات مع Iauto - حيث تتقارب Laravel و Vue.js والسيارات لإعادة تعريف سوق السيارات.",
    "Objective3": "الهدف الأساسي من \"iauto\" هو إنشاء منصة ديناميكية عبر الإنترنت تركز على المستخدم والتي تستخدم إمكانيات Laravel و Vue.js لتسهيل مبيعات السيارات والمزادات الجذابة بسلاسة (\"السيارات\").من خلال تقديم واجهة أنيقة وبديهية ، ومعلومات شاملة للمركبة ، وعمليات المعاملات الشفافة ، ونظام تقديم العطاءات التفاعلية ، يهدف Iauto إلى توفير تجربة متطورة لعشاق السيارات والمشترين ، وتعزيز مجتمع نابض بالحياة مع إعادة تعريف الطريقة التي يتم بها شراء السيارات وبيعهامتصل.",
    
    "details4A": "مرحبًا بكم في \"Kathryn eBook\" - وجهة غامرة عبر الإنترنت مدعومة من PHP و WordPress ، وهي مكرسة حصريًا لإثراء تجربة القراءة الخاصة بك مع مجموعة متنوعة من الكتب الإلكترونية الآسرة.سواء كنت تبحث عن استراتيجيات عمل ثاقبة ، أو تجتاح الخيال ، أو الموارد التعليمية ، فإن Kathryn ebook هو منصة الانتقال الخاصة بك.من خلال واجهة أنيقة وسهلة الاستخدام ، تم تصميم هذا الموقع لتوصيل القراء بسلاسة بمجموعة مختارة من الكتب الإلكترونية عالية الجودة ، والتي تلبي مجموعة واسعة من المصالح وتوفير رحلة أدبية مرتفعة.",
    "details4B": "تم بناء Kathryn الإلكترونية على إطار PHP القوي ويسخره مرونة WordPress ، ويوفر مساحة جذابة وديناميكية لكل من المؤلفين والقراء.يمكن للمؤلفين بسهولة نشر وترويج وإدارة الكتب الإلكترونية الخاصة بهم ، والاستفادة من ميزات إنشاء المحتوى وإدارة المحتوى السلس على الموقع.وفي الوقت نفسه ، يمكن للقراء الوصول إلى مكتبة واسعة من الكتب الإلكترونية ، يرافق كل منها ملخصات مفصلة ، وملفات تعريف المؤلفين ، ومراجعات القارئ ، وتسهيل خيارات القراءة المستنيرة والثقة.",
    "details4C": "في كتاب Kathryn الإلكتروني ، نفهم أن الكتب الإلكترونية تقدم أكثر من مجرد كلمات على الشاشة - فهي توفر بوابة للأفكار الجديدة والمنظورات والمعرفة.من خلال تصميم المستخدم المتمحور حول المستخدم لدينا ، يمكن للقراء التنقل بشكل مريح من خلال الفئات ، واستكشاف المجموعات المنسقة ، واكتشاف الأحجار الكريمة الأدبية المخفية التي تتماشى مع اهتماماتهم.يضمن تكامل WordPress تصميمًا مستجيبًا وجذابًا بصريًا ، مما يضمن تجربة قراءة متسقة وممتعة عبر الأجهزة.",
    "details4D": "كتاب كاثرين الاليكتروني ليس مجرد مكتبة رقمية ؛إنه مجتمع مزدهر من المؤلفين والقراء الذين يشتركون في شغف الأدب.من خلال منتديات المناقشة التفاعلية ، ومقابلات المؤلف ، والمحتوى الحصري ، يعزز موقعنا على شبكة الإنترنت اتصالات ذات معنى وإثراء المحادثات ، مما يزيد من تعزيز الرابطة بين المبدعين وجمهورهم.احتضن عالم الأدب في العصر الرقمي مع كتاب Kathryn eBook - حيث تتقارب PHP و WordPress لإنشاء منصة متطورة وغامرة ، وسد الفجوة بين المؤلفين والقراء ورعاية نظام بيئي أدبي مزدهر.",
    "Objective4": "الهدف الأساسي من \"kathryn ebook\" هو إنشاء موقع وورد ديناميكي يعمل ببرنامج WordPress الذي يديره المستخدم والذي يعمل بمثابة منصة أعمال قوية للكتب الإلكترونية.يهدف هذا الموقع إلى ربط المؤلفين والقراء بطريقة سلسة وجذابة ، مما يوفر مجموعة متنوعة من الكتب الإلكترونية عالية الجودة التي تمتد على مختلف الأنواع والمواد.من خلال توفير واجهة أنيقة وبديهية ، إلى جانب تفاصيل الكتب الإلكترونية الشاملة ، وملفات تعريف المؤلفين ، ومراجعات القارئ ، تسعى كتاب Kathryn الإلكتروني إلى إنشاء سوق رقمي موثوق به ويمكن الوصول إليه حيث يمكن للقراء اكتشاف وشراء والاستمتاع بالكتب الإلكترونية التي يتردد صداها مع اهتماماتهم وتفضيلاتهم.من خلال هذه المنصة ، يمكن للمؤلفين أيضًا الاستفادة من قوة WordPress لنشر أعمالهم الأدبية وترويجها وإدارتها بسهولة ، وتعزيز مجتمع مزدهر من الكتاب والقراء الذين يشتركون في تقدير متبادل للكلمة المكتوبة.",
    
    "details5A": "مرحبًا بكم في Saadaah News ، مصدرك النهائي لأحدث وأكثر القصص الإخبارية ذات الصلة ، وكلها تم تقديمها من خلال موقع الويب الذي يعمل به Vue.js الديناميكي والغموض.Saadaah News هي أكثر من مجرد مدونة-إنها منصة حديثة وسهلة الاستخدام مصممة لإبقائك على اطلاع ومشاركة مع العالم المتطور من حولك.من خلال التحديثات في الوقت الفعلي ، والمرئيات الآسرات ، وواجهة بديهية ، تجلب Saadaah News الأخبار إلى الحياة ، مما يضمن عدم تفويت أي إيقاع.",
    "details5B": "مدعومًا من براعة Vue.js ، تقدم Saadaah News تجربة تصفح لا مثيل لها.من العناوين الرئيسية إلى التحليلات المتعمقة ، يعرض موقعنا على شبكة الإنترنت قصصًا إخبارية بتنسيق جذاب وسهل الهضم.من خلال التصميم المستجيب في جوهره ، يضمن Saadaah News انتقالًا سلسًا عبر أجهزة مختلفة ، مما يتيح لك البقاء على اتصال وإطلاع ما إذا كنت على سطح المكتب أو الكمبيوتر اللوحي أو الهاتف الذكي.",
    "details5C": "أخبار Saadaah لا تتعلق فقط بتقديم الأخبار - بل يتعلق بتمكينك بالمعرفة.تغطي منصتنا مجموعة واسعة من الموضوعات ، بدءًا من الشؤون العالمية والسياسة إلى التكنولوجيا والترفيه والصحة والمزيد.من خلال مقالات موجزة وغنية بالمعلومات ، وإشراك محتوى الوسائط المتعددة ، والميزات التفاعلية ، تهدف Saadaah News إلى تعزيز فهمك للعالم مع توفير منصة للمناقشات المدروسة ووجهات النظر الثاقبة.",
    "details5D": "كمدونة على الويب Vue.js ، تعطي Saadaah News مشاركة المستخدم وتفاعله.يتمتع القراء بفرصة ترك التعليقات ، ومشاركة مقالات على وسائل التواصل الاجتماعي ، والمشاركة في مناقشات هادفة حول الأخبار.من خلال تعزيز الشعور بالمجتمع وتعزيز تبادل المعلومات ، تقف Saadaah News كمساحة رقمية حيث يمكن للأفراد استكشاف أحدث العناوين الرئيسية وتوسيع آفاقهم والمساهمة في الحوار المستمر الذي يشكل مجتمعنا.",
    "details5E": "باختصار ، تعتبر Saadaah News أكثر من مجرد مدونة أخبار-إنها بوابة تعمل بنظام Vue.JS للأحداث والقصص الجارية المهمة.من خلال تصميمها السلس والتغطية الشاملة والميزات التفاعلية ، تدعوك Saadaah News إلى الغوص في عالم الأخبار والبقاء على اطلاع وإلهام ومشاركة كما لم يحدث من قبل.",
    "Objective5": "الهدف الأساسي لأخبار Saadaah هو توفير مدونة موقع ويب ديناميكية ومشاركة في موقع Vue.JS والتي تقدم أحدث القصص الإخبارية عبر مجموعة متنوعة من الموضوعات ، وتقدم للقراء منصة جذابة ، يمكن الوصول إليها بسهولة ، وتفاعلية للبقاء على اطلاع على Globalالأحداث ، تثير المناقشات ذات مغزى ، وتوسيع فهمها للعالم.",
    
    "details6A": "مرحبًا بكم في \"متجر الملابس\" ، وجهة التسوق الآسر عبر الإنترنت مدعومًا من WordPress و PHP ، المصممة لإحداث ثورة في تجربة التسوق في الأزياء.تم تخصيص منصة التجارة الإلكترونية الخاصة بنا لتقديم مجموعة متنوعة من الملابس والملحقات ، وكلها متوفرة بشكل مريح في متناول يدك.من خلال واجهة بديهية ، وتفاصيل شاملة للمنتج ، والمعاملات الآمنة ، والالتزام بأحدث اتجاهات الموضة ، فإن متجر الملابس هو مدربك الافتراضي إلى عالم من الأناقة والأناقة.",
    "details6B": "بنيت على الأساس الموثوق به من WordPress ويسخير من خلال مرونة PHP ، يوفر متجر الملابس تجربة تصفح سلسة وجذابة.سواء كنت تبحث عن الأساسيات اليومية أو قطع التصريحات للأزياء ، فإن منصتنا تعرض مجموعة واسعة من الخيارات للرجال والنساء والأطفال ، مما يضمن أن كل متجر يجد المجموعة المثالية للتعبير عن أسلوبهم الفريد.من الفساتين الأنيقة إلى الأحذية والملحقات الأنيقة ، يقوم متجر الملابس بإعداد مجموعة متطورة باستمرار لتناسب جميع المناسبات.",
    "details6C": "التسوق في متجر الملابس لا يتعلق فقط بشراء الملابس ؛يتعلق الأمر بتبني نمط حياة خيارات واعية للأزياء.من خلال أوصاف المنتج التفصيلية ، والصور عالية الجودة ، ومراجعات العملاء ، فإن نظامنا الأساسي يمكّن المتسوقين من اتخاذ قرارات مستنيرة ، وتعزيز الشعور بالثقة والرضا عن كل عملية شراء.يضمن دمج بوابات الدفع الآمنة وتدابير حماية البيانات القوية تجربة تسوق خالية من القلق ، مما يتيح لك الانغماس في عالم الموضة دون المساس بالأمان.",
    "details6D": "في عصر رقمي حيث تلتقي الراحة بالأناقة ، يجلب متجر الملابس تجربة البوتيك على شاشتك.من راحة منزلك ، يمكنك استكشاف أحدث الاتجاهات ، واكتشاف الوافدين الجدد ، وبناء خزانة منسقة دون عناء تعكس شخصيتك.بصفته موقع WordPress PHP Ecrommerce ، فإن متجر الملابس ليس مجرد متجر افتراضي ؛إنه مجتمع للأزياء الذي يحتفل بالفردية ، ويقدم عالمًا من الخيارات ، ويعيد تعريف التسوق عبر الإنترنت من خلال تقديم الموضة مباشرة إلى بابك.",
    "Objective6": "الهدف الأساسي من \"متجر الملابس\" هو إنشاء موقع وورد ديناميكي ومتمحور حوله للمستخدم يوفر منصة تسوق عبر الإنترنت سلسة للعملاء الذين يبحثون عن مجموعة متنوعة من الملابس والإكسسوارات عالية الجودة.من خلال تقديم واجهة بديهية ومعلومات مفصلة للمنتج والمعاملات الآمنة والفعالة والالتزام بأحدث اتجاهات الموضة ، يهدف متجر الملابس إلى إعادة تعريف الطريقة التي يتسوق بها الأفراد للملابس عبر الإنترنت.تسعى نظامنا الأساسي إلى تمكين العملاء من استكشاف واختيار وشراء عناصر الموضة التي تتوافق مع أسلوبهم الشخصي ، مما يعزز الشعور بالراحة والرضا والتعبير عن الذات في عالم البيع بالتجزئة عبر الإنترنت.",
    
    "details7A": "مرحبًا بكم في موقع \"Portfolio Website\" ، وهو تطبيق آسر Vue JS الذي يعرض مجموعة رائعة من عمل مطور ويب WordPress الماهر.أثناء التنقل من خلال موقع الويب المصمم بعناية ، ستكتشف محفظة تبرز خبرة المطور وإبداعها وتفانيها في صياغة تجارب استثنائية عبر الإنترنت.من خلال التكامل السلس لـ Vue JS ، يقدم موقع Portfolio رحلة غامرة وتفاعلية تتيح لك استكشاف مشاريع وخبرات المطور المتنوعة.",
    "details7B": "المبني على براعة Vue JS ، لا يقدم موقع Portfolio موقع المطور فقط عمل المطور ولكنه يوفر أيضًا نظرة ثاقبة على عملية التصميم والمهارات التقنية.يتم عرض كل مشروع بأناقة ، ويتضمن أوصافًا مفصلة ، وصورًا آسرة ، والعناصر التفاعلية التي تتيح لك الغوص أعمق في مساهمات المطور.من السمات المخصصة والمكونات الإضافية المبتكرة إلى التصميمات المستجيبة والواجهات السهلة للاستخدام ، يوضح موقع الويب قدرة المطور على تحويل الأفكار إلى مواقع ووردبريس الوظيفية والجذابة بصريًا.",
    "details7C": "يتجاوز موقع المحفظة عرض المشاريع النهائية ؛إنه يوفر لمحة عن الرحلة الإبداعية للمطور وبراعة حل المشكلات.من خلال دمج دراسات الحالة ، وشهادات العميل ، ورؤى الكواليس ، يقدم الموقع نظرة شاملة على كيفية تعامل المطور مع التحديات ، ويتعاون مع العملاء ، ويوفر نتائج استثنائية في النهاية.سواء كنت عميلًا محتملًا يبحث عن مطور ويب WordPress الماهر أو نظير الصناعة يبحث عن الإلهام ، يوفر موقع الويب الخاص بالمحفظة موردًا قيماً لفهم مهارات المطور ورؤية.",
    "details7D": "في المشهد الرقمي المتطور باستمرار ، يقف موقع الويب الخاص بالمحفظة بمثابة شهادة على قوة Vue JS في إنشاء عرض جذاب ومفيد على الإنترنت.من خلال الجمع بين ميزات Vue JS بسلاسة مع مشاريع WordPress الاستثنائية للمطور ، يقدم الموقع منصة مقنعة لاستكشاف عمل المطور وتقديره والتواصل معه.سواء كنت متحمسًا لتطوير الويب أو ببساطة مفتونًا بفن تحويل المفاهيم إلى الواقع الافتراضي ، يدعوك موقع Portfolio إلى الشروع في رحلة ملهمة من خلال الإنجازات الرقمية لمطور ويب WordPress.",
    "Objective7": "الهدف من موقع React Next.js الخاص بنا، والمزين بتصميم Tailwind CSS، هو تزويد الزائرين بتجربة جذابة وسلسة عبر الإنترنت.من خلال تصميمها الأنيق والحديث، تهدف الصفحة المقصودة إلى جذب الثقة وترسيخها، بينما تلبي صفحات الخدمات والاتصال والمعلومات عنا والتسجيل وتسجيل الدخول احتياجات المستخدمين المختلفة.الاستفادة من قوة Tailwind CSS تضمن تصميمًا متسقًا وسريع الاستجابة طوال الوقت، مما يعزز تفاعل المستخدم والتنقل.من خلال الجمع بين التقنيات المتطورة، يسعى موقعنا الإلكتروني إلى نقل خبرة علامتنا التجارية وتعزيز الاتصالات وتوفير بوابة سهلة الاستخدام لخدماتنا وعروضنا.",
    
    "Objective8": "الهدف الرئيسي من تطبيق الويب لتوليد الصور هو توفير واجهة أمامية سهلة الوصول باستخدام Vue 3 للمستخدمين للاستفادة من إنشاء الصور بالذكاء الاصطناعي عبر واجهة OpenAI DALL-E API.",
    "details8A": "هذا تطبيق ويب لتوليد الصور مبني باستخدام Vue 3 يتيح للمستخدمين إنشاء صور من خلال واجهة DALL-E API الخاصة بـ OpenAI. يتميز التطبيق بواجهة مستخدم بسيطة ونظيفة مع حقل إدخال نصي.",
    "details8B": "عندما يدخل المستخدم وصفاً وينقر على زر 'توليد صورة'، يتم إرسال طلب إلى واجهة OpenAI API مع وصف المستخدم. بعد ذلك يعرض التطبيق الصورة التي أنشأها الذكاء الاصطناعي في الواجهة مباشرة.",
    "details8C": "بعض التفاصيل التقنية الرئيسية: تم استخدام Vue 3 كإطار عمل للواجهة الأمامية لبناء واجهة المستخدم والتعامل مع التفاعلية والمكونات. تم الاستفادة من ميزات مثل Composition API وfragments.",
    "details8D": "باختصار، هو تطبيق Vue 3 بسيط يوفر واجهة سهلة للمستخدمين للحصول على صور مولدة بالذكاء الاصطناعي من OpenAI DALL-E باستخدام واجهتهم البرمجية. التركيز على الواجهة الأمامية وميزات Vue 3.",

    "details9A": "نقدم تطبيق التجارة الإلكترونية المتطور للهواتف، وهو مزيج سلس من التكنولوجيا والأناقة يستفيد من قوة Laravel وVue.js وBootstrap 5 وSweetAlert2 لتقديم تجربة تسوق عبر الإنترنت لا مثيل لها. تعيد هذه المنصة المبتكرة تعريف طريقة تفاعل المستخدمين مع التجارة الإلكترونية، وتوفر واجهة متجاوبة وسهلة الاستخدام وجذابة بصرياً.",
    "details9B": "في جوهرها، يستفيد تطبيقنا من إمكانيات Laravel، وهو إطار عمل PHP معروف، لضمان وظائف خلفية قوية. يدير Laravel بسلاسة قوائم المنتجات وملفات تعريف المستخدمين ومعالجة المعاملات، مما يضمن نظاماً آمناً وفعالاً للتجارة الإلكترونية. بناءً على هذه الأساسات المتينة، يعزز Vue.js الواجهة الأمامية بميزات ديناميكية وتفاعلية. يمكن للمتسوقين توقع تحديثات في الوقت الفعلي، وإدارة سلة ديناميكية، وتنقل سلس، مما يعزز رحلة تسوق جذابة حقاً.",
    "details9C": "لتكمل الوظائف المتطورة، يقدم Bootstrap 5 مبادئ التصميم المتجاوب، مما يضمن تكيف التطبيق بسلاسة عبر مختلف أحجام الشاشات والأجهزة. يجلب دمج Bootstrap 5 مظهراً حديثاً وأنيقاً ومتناسقاً، مما يوفر للمستخدمين واجهة بديهية وجذابة بصرياً توجههم بسهولة خلال جهود التسوق الخاصة بهم.",
    "details9D": "لإضافة لمسة من التطور، قمنا بدمج SweetAlert2 لتعزيز تفاعلات المستخدم. تتكامل مكتبة التنبيهات الأنيقة هذه بسلاسة في التطبيق، وتقدم تنبيهات وطلبات وتأكيدات أنيقة وقابلة للتخصيص. سواء كان الأمر يتعلق بإخطار المستخدمين بالمشتريات الناجحة، أو توجيههم خلال عملية الدفع، أو طلب التأكيد للإجراءات الحاسمة، فإن SweetAlert2 يرفع تجربة المستخدم من خلال عناصره المرئية الأنيقة والرسوم المتحركة السلسة.",
    "details9E": "باختصار، يعد تطبيق التجارة الإلكترونية Laravel Vue للهواتف شهادة على دمج التقنيات المتطورة والتصميم المرتكز على المستخدم. من خلال الجمع بين قوة كفاءة Laravel الخلفية، وتفاعلية Vue.js الأمامية، وأناقة Bootstrap 5 المتجاوبة، وتنبيهات SweetAlert2 الأنيقة، قمنا بإنشاء منصة استثنائية تعيد تعريف التسوق عبر الإنترنت. مرحباً بك في عصر جديد من التجارة الإلكترونية، حيث تلتقي الابتكار والجماليات لتقديم مغامرة تسوق لا مثيل لها في متناول يدك.",
    "Objective9": "الهدف من تطبيق التجارة الإلكترونية Laravel Vue للهواتف هو تزويد المستخدمين بتجربة تسوق عبر الإنترنت سلسة وجذابة، مستفيدين من التآزر بين الخلفية القوية لـ Laravel، والواجهة الأمامية الديناميكية لـ Vue.js، والتصميم المتجاوب لـ Bootstrap 5، وتنبيهات SweetAlert2 الأنيقة. من خلال تقديم واجهة سهلة الاستخدام، وتحديثات في الوقت الفعلي، وإدارة سلة فعالة، ومعالجة معاملات آمنة، يهدف تطبيقنا إلى إعادة تعريف التجارة الإلكترونية، مما يضمن الراحة والتفاعل والجاذبية المرئية للمستخدمين أثناء استكشافهم واختيارهم وشرائهم للمنتجات على مختلف الأجهزة.",

    "details10A": "مرحباً بك في عالم التكنولوجيا والابتكار في \"متجر عنابة للهواتف\"، وجهتك النهائية للإلكترونيات المتطورة والأجهزة المحمولة. يعمل متجر التجارة الإلكترونية الخاص بنا على منصة WordPress الديناميكية، ويجمع بين قوة التسوق عبر الإنترنت بسلاسة ومرونة نظام إدارة المحتوى WordPress. من الهواتف الذكية إلى الساعات الذكية، ومن سماعات الرأس إلى الملحقات، يقدم متجر عنابة للهواتف مجموعة مختارة تلبي احتياجات الفرد العصري الملم بالتكنولوجيا. مع التركيز على التصميم سهل الاستخدام والالتزام بالتميز، فإن التنقل في متجرنا المدعوم بـ WordPress ممتع مثل اكتشاف أحدث الأجهزة.",
    "details10B": "في متجر عنابة للهواتف، يعيد موقعنا المدعوم بـ WordPress تعريف تجربة التسوق عبر الإنترنت. لقد استفدنا من تنوع WordPress لإنشاء واجهة بديهية وجذابة بصرياً ترحب بالعملاء بتصميم أنيق وملاحة سهلة الاستخدام. سواء كنت على سطح المكتب أو الجهاز اللوحي أو الهاتف الذكي، يضمن التخطيط المتجاوب لدينا انتقالاً سلساً عبر الأجهزة، مما يتيح لك التصفح والاستكشاف والتسوق بسهولة. مكننا دمج إضافات WordPress من إنشاء بيئة تجارة إلكترونية متطورة حيث يمكن للعملاء تحسين عمليات البحث ومقارنة المنتجات والوصول إلى معلومات مفصلة في متناول أيديهم.",
    "details10C": "يتم تحقيق التزامنا بتقديم مجموعة شاملة من منتجات التكنولوجيا من خلال ميزة WordPress. من خلال الاستفادة من قدراتها القوية، نحافظ على كتالوج متوسع باستمرار للإلكترونيات من الدرجة الأولى. من الهواتف الذكية الرائدة إلى أحدث الأجهزة القابلة للارتداء، يوفر متجرنا المدعوم بـ WordPress مجموعة متنوعة من الخيارات تناسب كل الأذواق والمتطلبات. تتم إدارة التحديثات المنتظمة بسهولة، مما يضمن أن يكون لدى عملائنا إمكانية الوصول إلى أحدث التطورات في عالم التكنولوجيا. كما يتيح لنا إطار عمل WordPress دمج ملاحظات العملاء، مما يمكن المتسوقين من اتخاذ قرارات مستنيرة بناءً على مراجعات حقيقية.",
    "details10D": "الأمان والراحة والمجتمع هي الركائز الأساسية لتجربة متجر عنابة للهواتف. أثناء بدء رحلة التسوق الخاصة بك، يضمن منصتنا للتجارة الإلكترونية القائمة على WordPress عملية دفع آمنة من خلال بوابات الدفع الموثوقة وتدابير التشفير. لكن التزامنا لا ينتهي بالمعاملات؛ تعزز أقسام المراجعات وملاحظات العملاء المدمجة لدينا إحساساً بالمجتمع، مما يتيح لك اتخاذ قرارات مستنيرة بناءً على تجارب المتسوقين الآخرين. مع نظام دعم العملاء المتجاوب المنسوج بسلاسة في موقع WordPress الخاص بنا، المساعدة دائماً على بعد نقرة واحدة. متجر عنابة للهواتف ليس مجرد متجر؛ إنه مزيج ديناميكي من التكنولوجيا والتصميم والمجتمع، يقدم لك طريقة لا مثيل لها لاستكشاف واكتساب أحدث ابتكارات الهواتف المحمولة.",
    "Objective10": "الهدف الرئيسي لمتجر عنابة للهواتف، المدعوم بـ WordPress، هو توفير منصة تسوق عبر الإنترنت سهلة الاستخدام وشاملة لمنتجات تكنولوجيا الهواتف المحمولة. من خلال الاستفادة من القدرات الديناميكية لـ WordPress، نسعى إلى تنظيم كتالوج محدث للهواتف الذكية والملحقات والأجهزة، مما يقدم للعملاء تجربة سلسة وجذابة بصرياً عبر الأجهزة. نحن نعطي الأولوية لبناء الثقة والمجتمع من خلال ميزات مراجعات وملاحظات العملاء المدمجة، وتعزيز اتخاذ القرارات المستنيرة وإحساس بالتفاعل. مع التركيز القوي على الأمان، هدفنا هو ضمان خصوصية بيانات العملاء طوال رحلة التسوق.",

    "details11A": "مرحباً بك في صفحتنا الرئيسية العصرية والأنيقة المدعومة بـ React وNext.js! يعرض هذا الموقع الديناميكي المزيج المثالي من الجماليات والوظائف، مستفيداً من قوة Tailwind CSS لتجربة مستخدم استثنائية. تجذب الصفحة الرئيسية الزوار بتصميمها النظيف، مستخدمة لوحة ألوان متناسقة وخطوط واضحة لنقل الاحترافية والموثوقية. عندما يصل المستخدمون إلى الصفحة، يتم جذبهم فوراً إلى الصور المختارة بعناية التي تمثل هوية علامتنا التجارية، مما يحدد نغمة رحلة عبر الإنترنت لا تُنسى.",
    "details11B": "التنقل في الموقع بديهي وسلس، بفضل التنفيذ المدروس لـ React وNext.js. تظل قائمة التنقل سهلة الوصول، مما يتيح للمستخدمين استكشاف الأقسام المختلفة، بما في ذلك صفحات الخدمات والاتصال ومن نحن والتسجيل وتسجيل الدخول. تحافظ كل صفحة على لغة تصميم متناسقة، مما يوفر إحساساً بالتماسك طوال تجربة التصفح. يبرز Tailwind CSS كعمود فقري للتصميم لدينا، مما يتيح التطوير السريع دون المساس بالتخصيص. من تعديلات التخطيط المتجاوب إلى رسوم الأزرار المعقدة، يترجم Tailwind CSS بسهولة رؤية التصميم لدينا إلى واقع.",
    "details11C": "تعتبر صفحة الخدمات لدينا شهادة على خبرتنا، حيث تعرض مجموعة من العروض بطريقة جذابة بصرياً. مع أوصاف موجزة وصور جذابة، يمكن للزوار فهم القيمة التي نقدمها بسرعة. تبسط صفحة الاتصال التواصل، وتضم نموذجاً سهلاً للاستخدام يشجع على الاستفسارات. يضمن نهج Tailwind CSS القائم على المرافق نموذجاً متجاوباً عبر الأجهزة، مما يعزز تفاعل المستخدم. وفي الوقت نفسه، تتناول صفحة من نحن قصة علامتنا التجارية، وتعرض ملفات تعريف أعضاء الفريق بصور مقنعة. تجعل هذه الصفحة العلامة التجارية أكثر إنسانية، وتعزز الاتصال بالمستخدمين.",
    "details11D": "لتجربة مخصصة، يمكن للمستخدمين الوصول إلى صفحات التسجيل وتسجيل الدخول. تعطي بوابات المصادقة هذه الأولوية للأمان دون التضحية بسهولة الاستخدام. يحافظ Tailwind CSS على نمط متناسق في جميع أنحاء الموقع، حتى على هذه الصفحات الحاسمة، مما يضمن انتقالاً سلساً. تتميز صفحة التسجيل بنموذج مبسط للمستخدمين الجدد، بينما تقدم صفحة تسجيل الدخول عملية تسجيل دخول سهلة للزوار العائدين. تتوافق كلتا الصفحتين مع لغة التصميم الشاملة، مما يعرض التزامنا بتقديم رحلة متماسكة من لحظة وصول المستخدمين إلى صفحتنا الرئيسية.",
    "Objective11": "الهدف من موقعنا React Next.js، المزين بتصميم Tailwind CSS، هو تزويد الزوار بتجربة عبر الإنترنت جذابة وسلسة. من خلال تصميمها الأنيق والعصري، تهدف الصفحة الرئيسية إلى جذب وبناء الثقة، بينما تلبي صفحات الخدمات والاتصال ومن نحن والتسجيل وتسجيل الدخول احتياجات المستخدمين المختلفة. الاستفادة من قوة Tailwind CSS يضمن تصميماً متناسقاً ومتجاوباً في جميع أنحاء الموقع، مما يعزز تفاعل المستخدم والتنقل. من خلال الجمع بين التقنيات المتطورة، يسعى موقعنا إلى نقل خبرة علامتنا التجارية، وتعزيز الاتصالات، وتوفير بوابة سهلة الاستخدام لخدماتنا وعروضنا.",
            
    "details12A": "باباش جيت هي صفحة هبوط متطورة مبنية باستخدام React.js، مصممة بهدف ثوري في طريقة تفاعل المواطنين مع الخدمات الحكومية عبر الإنترنت. تستند هذه المنصة المبتكرة إلى مبادئ إمكانية الوصول والشفافية وسهولة الاستخدام، بهدف خلق تجربة سلسة للأفراد الباحثين عن مختلف الخدمات الحكومية. يمثل باباش جيت قفزة كبيرة إلى الأمام في تعزيز الكفاءة ورضا المستخدمين المرتبط بالتفاعلات عبر الإنترنت مع الحكومة.",
    "details12B": "في قلب باباش جيت تكمن واجهة تركز على المستخدم مصممة بعناية لتلبية احتياجات الأفراد من جميع المستويات التقنية. تتميز صفحة الهبوط بتصميم جذاب بصرياً لا يقتصر على الجماليات فحسب، بل يعطي الأولوية لسهولة التنقل. من خلال مراعاة دقيقة لتجربة المستخدم، يضمن باباش جيت أن يتمكن المواطنون من استكشاف والوصول إلى مجموعة من الخدمات الحكومية بسهولة، منظمة في فئات منطقية. يعزز هذا التصميم البديهي الشمولية، مما يدعو المستخدمين من خلفيات متنوعة للتفاعل مع العروض الحكومية بثقة.",
    "details12C": "لضمان أمن وخصوصية بيانات المواطنين، ينفذ باباش جيت آليات مصادقة قوية. يمكن للمواطنين تسجيل الدخول بأمان للوصول إلى الخدمات المخصصة، وتقديم الطلبات، وتتبع تقدم طلباتهم. تكرس المنصة جهودها لتبسيط عمليات التقديم، وتقليل التعقيدات البيروقراطية، وتعزيز الشفافية. يتلقى المستخدمون إشعارات في الوقت المناسب حول حالة طلباتهم، مما يمنحهم معلومات فورية وثقة في كفاءة العمليات الحكومية.",
    "details12D": "مع إدراك التنوع الثقافي للسكان، يتميز باباش جيت بتقديم دعم للغات متعددة. يتم القضاء على حواجز اللغة، مما يضمن أن المواطنين، بغض النظر عن خلفيتهم اللغوية، يمكنهم الوصول إلى الخدمات الحكومية بسلاسة. تشجع المنصة أيضاً على ملاحظات المستخدمين من خلال آلية مخصصة، مما يسهل حواراً مستمراً بين المواطنين والإداريين. يسمح هذا الالتزام بالتحسين المستمر لباباش جيت بالتكيف مع احتياجات المستخدمين المتطورة، مما يجعله بوابة ديناميكية ومستجيبة للمواطنين الذين يتفاعلون مع الخدمات الحكومية عبر الإنترنت. من خلال نهجها متعدد الأوجه، يعيد باباش جيت تعريف مشهد التفاعل بين المواطن والحكومة عبر الإنترنت، ويضع معايير جديدة للكفاءة والشفافية ورضا المستخدم.",
    "Objective12": "الهدف الرئيسي من باباش جيت هو إنشاء منصة موحدة وفعالة للمواطنين للوصول إلى الخدمات الحكومية عبر الإنترنت. يشمل ذلك تبسيط العمليات، وتحسين الشفافية، وتعزيز تجربة مستخدم إيجابية. من خلال تقديم واجهة سهلة الاستخدام، ومصادقة آمنة، وعمليات تقديم مبسطة، يهدف باباش جيت إلى سد الفجوة بين المواطنين والخدمات الحكومية، مما يساهم في نهاية المطاف في إدارة عامة أكثر استجابة وتركز على المواطن.",

    "details13A": "تظهر Stockifly كحل شامل لإدارة المخزون تم تصميمه بعناية على أسس قوية من Laravel و Vue.js. تجد الشركات التي تسعى لتحقيق كفاءة في مراقبة المخزون وإدارته أن Stockifly هو مصدر للموثوقية والابتكار. في جوهرها واجهة سهلة الاستخدام، صممت وفقًا لتوجيهات التصفح البديهية. تضمن هذه الصفحة النظيفة أن يتمكن المستخدمون من المشاركة بسهولة في مهام المخزون المختلفة دون مواجهة أي عوائق، مما يعزز الإنتاجية وسهولة العمل.",
    "details13B": "واحدة من ميزات Stockifly المتميزة هي قدرتها المتقدمة على تتبع المخزون. من خلال هذا النظام، يحصل المستخدمون على رؤى فورية في مستويات المخزون وحركة المنتجات. سواء كان الأمر يتعلق بمراقبة مستويات المخزون، أو تتبع حركة المنتجات، أو الحصول على تحديثات فورية حول حالة المخزون، فإن Stockifly يمنح الشركات الأدوات اللازمة لإدارة المخزون بكفاءة. هذه الشفافية والفورية في البيانات تضمن أن يتمكن الشركات من اتخاذ قرارات مستنيرة بسرعة، مما يعزز الكفاءة التشغيلية.",
    "details13C": "علاوة على ذلك، يتباهى Stockifly بوظائف إدارة الطلبات القوية، والتي تسهل معالجة الطلبات بسهولة، وتتبعها، وإدارة معاملات العملاء. يمكن للشركات مراقبة حالات الطلب وإدارة تفاعلات العملاء بسهولة. علاوة على ذلك، تقدم أدوات التقارير والتحليل في النظام رؤى لا تقدر بثمن في اتجاهات المبيعات وحركات المخزون وأداء المخزون العام. تمنح هذه القدرات التحليلية الشركات القدرة على تحسين استراتيجياتها في المخزون ودفع النمو من خلال قرارات تعتمد على البيانات.",
    "details13D": "مع دعمها للمستخدمين المتعددين وخيارات التخصيص، يلبي Stockifly احتياجات الشركات المتنوعة عبر الصناعات. يتم تعزيز بيئات العمل التعاوني من خلال تعيين الأدوار والأذونات، مما يضمن أمان البيانات والمساءلة. بالإضافة إلى ذلك، تمكن إمكانيات التكامل في النظام تبادل البيانات بسلاسة مع تطبيقات الأعمال والأنظمة الأخرى، مما يعزز العمليات ويعزز الكفاءة. يعزز التصميم الاستجابي لـ Stockifly إمكانية الوصول إليه، مما يسمح للمستخدمين بإدارة مهام المخزون بسهولة من أجهزة مختلفة. في الجوهر، يقف Stockifly كحل قابل للتوسيع وموثوق به، يقدم للشركات الحنكة والرؤية اللازمة للنجاح في السوق الديناميكية الحالية.",
    
    "details14A": "Roxboro هو تطبيق ويب Laravel دينامي مصمم بعناية ليكون نظام إدارة محتوى شامل (CMS) لأغراض التدوين. باستغلال قوة PHP Laravel و Bootstrap و jQuery، يوفر Roxboro منصة سهلة الاستخدام وغنية بالميزات للمدونين لإنشاء وإدارة ونشر المحتوى بسهولة. في جوهره، يجسد Roxboro البساطة والكفاءة، مما يقدم للمستخدمين تجربة سلسة في إنشاء مشاركات المدونة المقنعة وإدارة وجودهم على الإنترنت.",
    "details14B": "في صميم Roxboro يقع التركيز الأساسي على واجهة المستخدم سهلة الاستخدام، مصممة لكل من المدونين والقراء على حد سواء. من خلال تصميمه النظيف والبديهي، يمكن للمستخدمين التنقل بسهولة عبر المنصة، سواء كان الأمر يتعلق بإنشاء مشاركات مدونة جديدة أو إدارة الفئات والعلامات، أو التفاعل مع تعليقات القراء. يضمن هذا التصميم المبسط أن يمكن للمستخدمين التركيز على إنشاء محتوى جذاب دون أن يتعثروا في تعقيدات غير ضرورية، مما يعزز الإنتاجية ورضا المستخدمين.",
    "details14C": "الخلفية القوية لـ Roxboro، التي تعمل بتقنية Laravel، توفر للمدونين مجموعة من الأدوات القوية لإنشاء وإدارة المحتوى. مع ميزات مثل محررات WYSIWYG، وتحميل الصور، وإمكانيات حفظ المسودات، يمكن للمدونين جلب أفكارهم إلى الحياة بسهولة مع الحفاظ على السيطرة الكاملة على محتواهم. علاوة على ذلك، تسمح الهندسة المعمارية المرنة لـ Roxboro بالتخصيص السهل والتوسع، مما يضمن أن يمكن للمنصة التكيف مع احتياجات المدونين المتطورة مع نمو جمهورهم وتطور استراتيجيتهم للمحتوى.",
    "details14D": "بالإضافة إلى واجهة المستخدم البديهية وإمكانيات الخلفية القوية، يقدم Roxboro مجموعة من التحسينات الأمامية لتعزيز تجربة القراءة للزوار. باستغلال Bootstrap و jQuery، يقدم Roxboro تخطيط مدونة استجابيًا وجذابًا بصريًا يتكيف بسلاسة مع أحجام الشاشة والأجهزة المختلفة. من خلال ميزات مثل القوائم الملاحية الاستجابية، وسلاسل الصور، وأقسام التعليقات التفاعلية، يضمن Roxboro أن يتمتع القراء بتجربة تصفح متسقة وجذابة عبر منصات سطح المكتب والهواتف المحمولة.",
    
    "details15A": "نظام إدارة المخزون باستخدام Laravel PHP هو حل شامل مصمم لتبسيط وتأتيمتة تتبع المخزون ومعالجة الطلبات والتحكم في المخزون لشركات مختلفة الأحجام. يمكن لهذا التطبيق الويبي تمكين المنظمات من إدارة مستويات مخزونها بكفاءة، ومراقبة حركة المنتجات، وتحسين عمليات سلسلة التوريد.",
    "details15B": "الميزات الرئيسية:",
    "details15C": "المصادقة والتفويض للمستخدم:\nنظام مصادقة مستخدم آمن مع التحكم في الوصول بناءً على الأدوار.\nأدوار مستخدم مختلفة مثل المسؤول والمدير والموظفين بأذونات متنوعة.\nإدارة المنتجات:\nإضافة وتحرير وحذف المنتجات مع التفاصيل مثل الاسم والوصف والفئة والكمية.\nتتبع مستويات مخزون المنتج وتلقي إشعارات للعناصر ذات المخزون المنخفض.\nإدارة الموردين:\nإدارة معلومات المورد بما في ذلك تفاصيل الاتصال وتاريخ توريد المنتجات.\nتحديث تفاصيل المورد بسهولة وعرض تاريخ طلب الشراء.\nنظام طلب الشراء:\nإنشاء وإدارة طلبات الشراء لإعادة تعبئة المخزون.\nتتبع حالة الطلب، وتواريخ التسليم، وتفاصيل الموردين.\nمعالجة طلبات البيع:\nإنشاء طلبات بيع لعمليات شراء العملاء.\nتحديث الوقت الحقيقي لمستويات المخزون عند إجراء عمليات مبيعات ناجحة.\nتتبع المخزون:\nمراقبة مستويات المخزون في الوقت الحقيقي وتلقي تنبيهات للمخزون المنخفض.\nتتبع حركة المنتج وعرض بيانات المخزون التاريخية.\nالتقارير والتحليلات:\nإنشاء تقارير مفصلة حول مبيعات المنتجات ودوران المخزون وتاريخ الشراء.\nأدوات تحليلية لتحديد الاتجاهات واتخاذ قرارات العمل المستنيرة.\nلوحة التحكم سهلة الاستخدام:\nلوحة تحكم بديهية للوصول السريع إلى المعلومات الحاسمة.\nتمثيل بصري لمؤشرات الأداء الرئيسية.\nالإشعارات والتنبيهات:\nتلقي إشعارات بالبريد الإلكتروني أو في التطبيق لمستويات المخزون الحرجة، وتغييرات حالة الطلب، والمزيد.\nإعدادات التنبيه قابلة للتخصيص.",
    "details15D": "التقنيات المستخدمة:",
    "details15E": "إطار عمل Laravel PHP\nقاعدة بيانات MySQL\nHTML، CSS، JavaScript Bootstrap\nAJAX للتحديثات الفورية\nLaravel Eloquent ORM",
    
    "details16A": "نظام إدارة المخزون باستخدام Laravel PHP هو حل شامل مصمم لتبسيط وتأتيمتة تتبع المخزون ومعالجة الطلبات والتحكم في المخزون لشركات مختلفة الأحجام. يمكن لهذا التطبيق الويبي تمكين المنظمات من إدارة مستويات مخزونها بكفاءة، ومراقبة حركة المنتجات، وتحسين عمليات سلسلة التوريد.",
    "details16B": "الميزات الرئيسية:",
    "details16C": "المصادقة والتفويض للمستخدم:\nنظام مصادقة مستخدم آمن مع التحكم في الوصول بناءً على الأدوار.\nأدوار مستخدم مختلفة مثل المسؤول والمدير والموظفين بأذونات متنوعة.\nإدارة المنتجات:\nإضافة وتحرير وحذف المنتجات مع التفاصيل مثل الاسم والوصف والفئة والكمية.\nتتبع مستويات مخزون المنتج وتلقي إشعارات للعناصر ذات المخزون المنخفض.\nإدارة الموردين:\nإدارة معلومات المورد بما في ذلك تفاصيل الاتصال وتاريخ توريد المنتجات.\nتحديث تفاصيل المورد بسهولة وعرض تاريخ طلب الشراء.\nنظام طلب الشراء:\nإنشاء وإدارة طلبات الشراء لإعادة تعبئة المخزون.\nتتبع حالة الطلب، وتواريخ التسليم، وتفاصيل الموردين.\nمعالجة طلبات البيع:\nإنشاء طلبات بيع لعمليات شراء العملاء.\nتحديث الوقت الحقيقي لمستويات المخزون عند إجراء عمليات مبيعات ناجحة.\nتتبع المخزون:\nمراقبة مستويات المخزون في الوقت الحقيقي وتلقي تنبيهات للمخزون المنخفض.\nتتبع حركة المنتج وعرض بيانات المخزون التاريخية.\nالتقارير والتحليلات:\nإنشاء تقارير مفصلة حول مبيعات المنتجات ودوران المخزون وتاريخ الشراء.\nأدوات تحليلية لتحديد الاتجاهات واتخاذ قرارات العمل المستنيرة.\nلوحة التحكم سهلة الاستخدام:\nلوحة تحكم بديهية للوصول السريع إلى المعلومات الحاسمة.\nتمثيل بصري لمؤشرات الأداء الرئيسية.\nالإشعارات والتنبيهات:\nتلقي إشعارات بالبريد الإلكتروني أو في التطبيق لمستويات المخزون الحرجة، وتغييرات حالة الطلب، والمزيد.\nإعدادات التنبيه قابلة للتخصيص.",
    "details16D": "التقنيات المستخدمة:",
    "details16E": "إطار عمل Laravel PHP\nقاعدة بيانات MySQL\nHTML، CSS، JavaScript Bootstrap\nAJAX للتحديثات الفورية\nLaravel Eloquent ORM",
    
    "details17A": "The **Laravel React Event Management System** is a full-stack application designed to simplify event creation, management, and participation. It integrates a **Laravel JSON:API backend** with a **React frontend**, enhanced by the **Laravel Material Dashboard** for an intuitive admin panel. The system supports distinct user roles—admins with full event control and users limited to published events—alongside robust scheduling constraints. This project highlights skills in backend development, frontend design, and API integration, making it ideal for managing events like workshops or conferences with ease and efficiency.",
    "details17B": "Core Features The application offers a powerful **admin panel** for CRUD operations on events, defined by attributes like Name, Date & Time, Duration, Location, Capacity, Waitlist Capacity, and Live/Draft Status. **Users** can register, join events, and receive email confirmations and reminders, with restrictions preventing duplicate or overlapping event registrations. Capacity is managed via middleware, and a waitlist feature accommodates full events. The system ensures admins see all events while users view only published ones in a calendar, with joined events highlighted for clarity.",
    "details17C": "Technical Implementation The **backend** leverages Laravel with JSON:API standards, using Laravel Passport for authentication and mailtrap.io for notifications. Setup involves Composer, database migrations, and environment configuration for seamless deployment. The **frontend**, built with React and the Material Dashboard, requires Node.js and Yarn, with customizable environment variables for API paths and demo mode. This combination delivers a responsive, scalable solution that balances functionality with a modern user experience, catering to both administrators and attendees effectively.",
    "details17D": "Purpose and Contact This project demonstrates expertise in full-stack development, focusing on role-based access, scheduling logic, and user-friendly design. It's a practical tool for event organizers needing reliable management and participation features. The Laravel React Event Management System merges technical precision with real-world applicability, offering a streamlined platform for event coordination and engagement, adaptable to various use cases like community events or professional gatherings.",
    "Objective17": "The Laravel React Event Management System aims to evaluate and showcase the ability to build a robust full-stack application using Laravel and React. It focuses on implementing user roles—admins with full event oversight and users restricted to published events—alongside comprehensive event management and scheduling constraints. By integrating a Laravel JSON:API backend with a React frontend and Laravel Material Dashboard, the project tests skills in CRUD operations, authentication, capacity handling, and notification systems. The objective is to create an efficient, user-friendly platform for event organization and participation, suitable for real-world applications like workshops or conferences.",

    "Hi, Iam Mostfa": "مصطفى بوجمعة",
    "Job Title": " vuejs مطور ويب لارافيل و",
    "Skills": "المهارات",
    "JobTitle1": "مطور لارافيل",
    "JobCompany1": "Lead Capture LTD",
    "JobEndDate1": "الان",
    "JobStartDate1": "ماي 2023",
    "JobDescription1": "تكمن خبرتي في تنفيذ ميزات جديدة وحل الأخطاء لتطبيقات الويب. مع الحرص على التفاصيل وفهم قوي لقدرات Laravel ، أعمل بجد لتحسين وظائف وأداء مشاريع الويب. سواء كانت تضيف ميزات جديدة مثيرة أو تضمن تجارب مستخدم سلسة من خلال القضاء على الأخطاء ، وتكريس نفسي لتقديم حلول عالية الجودة.",
    "JobTitle2": "لارافيل Vue  مطور ويب",
    "JobCompany2": "ابوورك - فيفر",
    "JobStartDate2": "جانفي 2023",
    "JobEndDate2": "ماي 2023",
    "JobDescription2": "تصميم تطبيقات الويب المخصصة ، مما يضمن التكامل السلس بين الواجهة الأمامية والخلفية. مع خبرة واسعة في تطوير الويب ، وتقديم كود نظيف وقابل للصيانة ، والوفاء بالمواعيد النهائية للمشروع بكفاءة.",
    "JobTitle3": "Java ExtJS مطور ويب",
    "JobCompany3": "Big Informatique",
    "JobStartDate3": "ديسمبر  2017",
    "JobEndDate3": "جانفي 2020",
    "JobDescription3": "بصفتي مطور Java EE يتمتع بخبرة في ExtJS ، فإن دوري يدور حول تنفيذ ميزات جديدة وحل الأخطاء لتطبيقات الويب. مع خلفية قوية في تطوير Java Enterprise Edition (Java EE) وإطار عمل ExtJS ، أتفوق في إنشاء واجهات مستخدم ديناميكية وتفاعلية مع ضمان التكامل السلس مع الواجهة الخلفية. أنا متحمس لتقديم حلول عالية الجودة تعزز وظائف وتجربة المستخدم لمشاريع الويب. سواء أكان الأمر يتعلق ببناء ميزات مبتكرة أو معالجة المشكلات لتحسين أداء التطبيق ، فأنا ملتزم بتحقيق التميز.",
    "JobTitle4": "Laravel React Web Developer",
    "JobCompany4": "Info Gate",
    "JobStartDate4": "October 2023",
    "JobEndDate4": "March 2024",
    "JobDescription4": "كمطور Full Stack في Info Gate، ساهمت في تطوير وصيانة منصة Info Gate، وتخصصت في Laravel PHP وReact. من خلال العمل بشكل تعاوني مع فريق متنوع، لعبت دورًا رئيسيًا في جميع مراحل دورة حياة تطوير البرمجيات، بدءًا من التصميم وحتى النشر، مما يضمن الأداء العالي وقابلية التوسع للنظام الأساسي. لقد قمت بتطبيق ميزات جديدة وقاعدة تعليمات برمجية محسنة وحل الأخطاء لتحسين تجربة المستخدم. ساهم نهجي الاستباقي والالتزام بالتميز في نجاح المشروع.",
    "JobTitle5": "لارافيل Vue  مطور ويب",
    "JobCompany5": "Futuriva Marketing Agency",
    "JobStartDate5": "April 2024",
    "JobEndDate5": "Today",
    "JobDescription5": "باعتباري مطور ويب Laravel Vue في وكالة Futuriva للتسويق، فقد تخصصت في بناء تطبيقات الويب وصيانتها، والاستفادة من إطار عمل Laravel PHP وتقنية الواجهة الأمامية Vue.js. من خلال التركيز على Vuetify للتصميم سريع الاستجابة ونموذج Vuexy لإدارة الحالة بكفاءة، تعاونت بشكل وثيق مع فرق متعددة الوظائف لتقديم حلول عالية الجودة في المواعيد النهائية للمشروع. تضمنت مسؤولياتي تخصيص الميزات وإجراء مراجعات التعليمات البرمجية وتحسين أداء الواجهة الأمامية لضمان تجربة مستخدم استثنائية.",
    
    "JobTitle6": "مطور ويب Laravel React",
    "JobCompany6": "وكالة NewDay",
    "JobStartDate6": "مارس 2025",
    "JobEndDate6": "اليوم",
    "JobDescription6": "كمطور Laravel React في وكالة NewDay، أقوم بتطوير وصيانة تطبيقات الويب باستخدام Laravel في الخلفية وReact.js في الواجهة الأمامية. أركز على إنشاء واجهات مستخدم تفاعلية وسريعة الاستجابة وتحسين إدارة الحالة. من خلال التعاون مع الفرق متعددة التخصصات، أضمن تسليم مشاريع عالية الجودة في المواعيد المحددة. يشمل دوري أيضًا تخصيص الميزات، ومراجعة الكود، وتحسين أداء الواجهة الأمامية لتعزيز تجربة المستخدم بشكل عام.",


    "Employment History": "تاريخ التوظيف",
    "Services": "الخدمات",
    "Contact Us": "اتصل بنا",
    "Previous": "السابق",
    "Sending...": "جاري الإرسال...",
    "Next": "التالي",
    "Message sent successfully! ...": "تم إرسال الرسالة بنجاح! ...",
    "Home": "الرئيسية",
    "Popular Movie DB Website": "موقع قاعدة بيانات الأفلام الشهير",
    "Frontend": "الواجهة الأمامية",
    "MovieDb": "قاعدة بيانات الأفلام",
    "movie ranking services": "خدمات تصنيف الأفلام",
    "Tamtam Tools": "أدوات تمتم",
    "Frontend / Backend": "الواجهة الأمامية / الخلفية",
    "Tamtam tools Ltd": "شركة أدوات تمتم المحدودة",
    "Campaign generation services": "خدمات إنشاء الحملات",
    "eLearn": "التعلم الإلكتروني",
    "iAuto Business Website": "موقع أعمال iAuto",
    "Car store services": "خدمات متجر السيارات",
    "eBook": "كتاب إلكتروني",
    "Saadaah News": "أخبار السعادة",
    "detailsCD": "تفاصيل CD",
    "Image Generator OpenAI": "مولد الصور OpenAI",
    "Frontend / API": "الواجهة الأمامية / API",
    "Image Generator": "مولد الصور",
    "AI image generation": "توليد الصور بالذكاء الاصطناعي",
 }
