{
    "Projects": "Projects",
    "About Me": "About Me",
    "Contact": "Contact",
    "Close": "Close",
    "Download CV": "Download CV",
    "Blog Services": "Blog Services",
    "Phone store services": "Phone store services",
    "ar": "انجليزي",
    "en": "عربي",
    "Projects Screenshots": "Projects Screenshots",
    "404 Page Not found": "404 Page Not found",
    "AboutMe1": "Hello! I am a full-stack web developer with expertise in Laravel and Vue.js. With several years of experience in the field, I have honed my skills in building robust and scalable web applications that meet the needs of my clients.",
    "AboutMe2": "As a Laravel developer, I am well-versed in PHP and the Laravel framework, which I use to create backend solutions that power web applications. My proficiency in the Laravel framework allows me to build complex systems with ease, from database design to API integration.",
    "AboutMe3": "On the frontend, I specialize in Vue.js, which I use to create dynamic and interactive user interfaces. I am also proficient in HTML, CSS, and JavaScript, which I use to ensure seamless integration of the frontend and backend.",
    "AboutMe4": "In addition to my technical skills, I am committed to providing my clients with exceptional customer service. I take the time to understand their needs and work collaboratively with them to deliver solutions that exceed their expectations.",
    "AboutMe5": "If you're looking for a reliable and experienced Laravel and Vue.js developer to build your next web application, I would love to work with you. Let's connect and discuss your project requirements!",
    "Contact details": "Contact details",
    "Contact Form": "Contact Form",
    "Full Name": "Full Name",
    "Email": "Email",
    "Subject": "Subject",
    "Message": "Message",
    "Send Message": "Send Message",
    "Years of experience": "Years of experience",
    "Stars on GitHub": "Stars on GitHub",
    "Positive feedback": "Positive feedback",
    "Projects completed": "Projects completed",
    "Some of the brands I have worked with": "Some of the brands I have worked with",
    "Project Type": "Project Type",
    "Details": "Details",
    "Ecommerce": "Ecommerce",
    "Business Website": "Business Website",
    "Elearn": "Elearn",
    "Blogs": "Blogs",
    "What project are you looking for?": "What project are you looking for?",
    "Send Request": "Send Request",
    "Related Projects": "Related Projects",
    "Challenge": "Challenge",
    "About Client": "About Client",
    "Objective": "Objective",
    "Tools & Technologies": "Tools & Technologies",
    "Share This": "Share This",
    "Project Management UI": "Project Management UI",
    "UI / Frontend": "UI / Frontend",
    "Name": "Name",
    "Services": "Services",
    "Company Ltd": "Company Ltd",
    "Website": "Website",
    "Phone": "Phone",
    "UI Design & Frontend Development": "UI Design & Frontend Development",
    "details1": "Cross-browser compatibility: Different web browsers have different rendering engines and may interpret HTML, CSS, and JavaScript code differently. As a result, the UI design and frontend development of your web project may look and function differently across different browsers. Ensuring cross-browser compatibility can be a challenge, as it requires testing and debugging on multiple platforms and devices.",
    "details2": "Responsive design: With the increasing use of mobile devices to access the internet, it's important to design and develop websites that are responsive and adaptive to different screen sizes. This can be a challenge, especially when dealing with complex layouts or interactive features.",
    "details3": "Performance optimization: Users expect websites to load quickly and smoothly, and slow loading times or choppy animations can lead to frustration and a negative user experience. Optimizing website performance can be a challenge, as it involves finding a balance between delivering high-quality visuals and minimizing load times.",
    "details4": "Accessibility: Web accessibility ensures that users with disabilities can access and use your web project. This can involve designing and developing websites that are screen-reader-friendly, have keyboard shortcuts, and are easy to navigate with assistive technology. Ensuring web accessibility can be a challenge, as it requires a deep understanding of accessibility guidelines and testing with a range of assistive technologies.",
    "Phones Store": "Phones Store",
    "Blog": "Blog",
    "Clothes Store": "Clothes Store",
    "Business": "Business",
    "Portfolio": "Portfolio",
    "Portfolio": "Portfolio",
    "Objective1": "User-centered design: The goal of a user-centered design is to create a website that meets the needs of the user. The design and development of the website should be based on user research, feedback, and testing, and should prioritize usability and accessibility.  ",
    "Hire Me": "Hire Me",
    "Projects Portfolio": "Projects Portfolio",
    "Search projects by title or filter by category": "Search projects by title or filter by category",
    "All Projects": "All Projects",
    "More Projects": "More Projects",
    "Follow me": "Follow me",
    "Hi, Iam Mostfa": "Hi, Iam Mostfa",
    "Job Title": "a Laravel Vue JS developer"
}
