{
    "Projects": "Projects",
    "About Me": "About Me",
    "Contact": "Contact",
    "Close": "Close",
    "Download CV": "Download CV",
    "Blog Services": "Blog Services",
    "Phone store services": "Phone store services",
    "ar": "انجليزي",
    "en": "عربي",
    "Projects Screenshots": "Projects Screenshots",
    "404 Page Not found": "404 Page Not found",
    "AboutMe1": "Hello! I am a full-stack web developer with expertise in Laravel and Vue.js. With several years of experience in the field, I have honed my skills in building robust and scalable web applications that meet the needs of my clients.",
    "AboutMe2": "As a Laravel developer, I am well-versed in PHP and the Laravel framework, which I use to create backend solutions that power web applications. My proficiency in the Laravel framework allows me to build complex systems with ease, from database design to API integration.",
    "AboutMe3": "On the frontend, I specialize in Vue.js, which I use to create dynamic and interactive user interfaces. I am also proficient in HTML, CSS, and JavaScript, which I use to ensure seamless integration of the frontend and backend.",
    "AboutMe4": "In addition to my technical skills, I am committed to providing my clients with exceptional customer service. I take the time to understand their needs and work collaboratively with them to deliver solutions that exceed their expectations.",
    "AboutMe5": "If you're looking for a reliable and experienced Laravel and Vue.js developer to build your next web application, I would love to work with you. Let's connect and discuss your project requirements!",
    "Contact details": "Contact details",
    "Contact Form": "Contact Form",
    "Full Name": "Full Name",
    "Email": "Email",
    "Subject": "Subject",
    "Message": "Message",
    "Send Message": "Send Message",
    "Years of experience": "Years of experience",
    "Stars on GitHub": "Stars on GitHub",
    "Positive feedback": "Positive feedback",
    "Projects completed": "Projects completed",
    "Some of the brands I have worked with": "Some of the brands I have worked with",
    "Project Type": "Project Type",
    "Details": "Details",
    "Ecommerce": "Ecommerce",
    "Business Website": "Business Website",
    "Elearn": "Elearn",
    "Blogs": "Blogs",
    "What project are you looking for?": "What project are you looking for?",
    "Send Request": "Send Request",
    "Related Projects": "Related Projects",
    "Challenge": "Challenge",
    "About Client": "About Client",
    "Objective": "Objective",
    "Tools & Technologies": "Tools & Technologies",
    "Share This": "Share This",
    "Project Management UI": "Project Management UI",
    "UI / Frontend": "UI / Frontend",
    "Name": "Name",
    "Services": "Services",
    "Company Ltd": "Company Ltd",
    "Website": "Website",
    "Phone": "Phone",
    "UI Design & Frontend Development": "UI Design & Frontend Development",
    "details1": "Cross-browser compatibility: Different web browsers have different rendering engines and may interpret HTML, CSS, and JavaScript code differently. As a result, the UI design and frontend development of your web project may look and function differently across different browsers. Ensuring cross-browser compatibility can be a challenge, as it requires testing and debugging on multiple platforms and devices.",
    "details2": "Responsive design: With the increasing use of mobile devices to access the internet, it's important to design and develop websites that are responsive and adaptive to different screen sizes. This can be a challenge, especially when dealing with complex layouts or interactive features.",
    "details3": "Performance optimization: Users expect websites to load quickly and smoothly, and slow loading times or choppy animations can lead to frustration and a negative user experience. Optimizing website performance can be a challenge, as it involves finding a balance between delivering high-quality visuals and minimizing load times.",
    "details4": "Accessibility: Web accessibility ensures that users with disabilities can access and use your web project. This can involve designing and developing websites that are screen-reader-friendly, have keyboard shortcuts, and are easy to navigate with assistive technology. Ensuring web accessibility can be a challenge, as it requires a deep understanding of accessibility guidelines and testing with a range of assistive technologies.",
    "Phones Store": "Phones Store",
    "Blog": "Blog",
    "Clothes Store": "Clothes Store",
    "Employment History": "Employment History",
    "Business": "Business",
    "JobTitle1": "Laravel Web Developer",
    "JobCompany1": "Lead Capture LTD",
    "JobEndDate1": "Present",
    "JobStartDate1": "Mai 2023",
    "JobDescription1": "My expertise lies in implementing new features and resolving bugs for web applications. With a keen eye for detail and a solid understanding of Laravel's capabilities, I work diligently to enhance the functionality and performance of web projects. Whether it's adding exciting new features or ensuring smooth user experiences by eliminating bugs, and dedicating myself to deliver high-quality solutions.",
    "JobTitle2": "Laravel Vue Freelance Work",
    "JobCompany2": "Upwork - Fiverr",
    "JobStartDate2": "Jan 2023",
    "JobEndDate2": "Mai 2023",
    "JobDescription2": "crafting custom web applications, ensuring seamless integration between the frontend and backend. With extensive experience in web development, delivering clean and maintainable code, meeting project deadlines efficiently.",
    "JobTitle3": "Java ExtJS Web Developer",
    "JobCompany3": "Big Informatique",
    "JobStartDate3": "Dec 2017",
    "JobEndDate3": "Jan 2020",
    "JobDescription3": "As a Java EE developer with expertise in ExtJS, my role revolves around implementing new features and resolving bugs for web applications. With a strong background in Java Enterprise Edition (Java EE) development and ExtJS framework, I excel at creating dynamic and interactive user interfaces while ensuring seamless integration with the backend. I am passionate about delivering high-quality solutions that enhance the functionality and user experience of web projects. Whether it's building innovative features or addressing issues to improve the application's performance, I am committed to achieving excellence.",
    "Objective1": "User-centered design: The goal of a user-centered design is to create a website that meets the needs of the user. The design and development of the website should be based on user research, feedback, and testing, and should prioritize usability and accessibility.  ",
    "Hire Me": "Hire Me",
    "Projects I worked On": "Projects I worked On",
    "Search projects by title or filter by category": "Search projects by title or filter by category",
    "All Projects": "All Projects",
    "More Projects": "More Projects",
    "Follow me": "Follow me",
    
    "details0A": "This is an image generation web application built with Vue 3 that allows users to generate images through OpenAI's DALL-E API. The app has a simple and clean UI with a text input field where users can type a text prompt describing the image they want to generate.",
    "details0B": "When the user enters a prompt and clicks the 'Generate Image' button, a request is sent to the OpenAI API with the user's prompt. The app then displays the AI-generated image in the UI once it is received from the API.",
    "details0C": "Some key technical details:    Vue 3 is used as the front-end framework to build the UI and handle reactivity and components. Features like the Composition API and fragments are leveraged.    The OpenAI API key is stored securely and calls are made to the endpoint for image generation. Appropriate headers and parameters are included in the API request.    The generated image data is displayed in the UI by binding the API response to an image element.    Loading states and error handling are implemented to account for API results.    Styling is done using CSS and TailwindCSS to create the clean and responsive UI.",
    "details0D": "So in summary, it's a simple Vue 3 app that provides an easy interface for users to get AI-generated images from OpenAI's DALL-E using their API. The focus is on the frontend and Vue 3 integrations with OpenAI.",
    "Objective0": "The main objective of this image generation web application is to provide an accessible frontend interface using Vue 3 for users to leverage AI image creation through OpenAI's DALL-E API. By handling the API integration and reactive data binding in Vue 3, it aims to enable easy AI-powered image generation based on user text prompts. The app serves as a demonstration of integrating external APIs into a Vue 3 codebase, displaying reactive data, and implementing core Vue 3 concepts like components, Composition API, and more. It focuses on the front-end Vue 3 code to deliver a seamless user experience for AI image creation rather than being a feature-complete product. Overall, it mainly serves as an educational tool to explore Vue 3 development and AI image generation in a straightforward application.",
    
    
    "details1A": "det1",
    "details1B": "det2",
    "details1C": "det3",
    "details1D": "det4",
    // "Objective1": "obj1",
    
    
    "details2A": "det1",
    "details2B": "det2",
    "details2C": "det3",
    "details2D": "det4",
    "Objective2": "obj1",
    
    
    "details3A": "det1",
    "details3B": "det2",
    "details3C": "det3",
    "details3D": "det4",
    "Objective3": "obj1",
    
    
    "details4A": "det1",
    "details4B": "det2",
    "details4C": "det3",
    "details4D": "det4",
    "Objective4": "obj1",
    
    
    "details5A": "det1",
    "details5B": "det2",
    "details5C": "det3",
    "details5D": "det4",
    "Objective5": "obj1",
    
    
    "details6A": "det1",
    "details6B": "det2",
    "details6C": "det3",
    "details6D": "det4",
    "Objective6": "obj1",
    
    
    "details7A": "det1",
    "details7B": "det2",
    "details7C": "det3",
    "details7D": "det4",
    "Objective7": "obj1",
    
    
    "details8A": "det1",
    "details8B": "det2",
    "details8C": "det3",
    "details8D": "det4",
    "Objective8": "obj1",
    
    
    "details9A": "det1",
    "details9B": "det2",
    "details9C": "det3",
    "details9D": "det4",
    "Objective9": "obj1",
    
    "Job Title": "a Laravel Vue JS developer"
}
